{"pageProps":{"post":{"title":"resume-en","date":"2024-12-04","slug":"resume-en","author":{"name":"roamzhen","picture":"/assets/blog/authors/roam.jpeg"},"content":"<h1>You found me! Welcome to contact me :)</h1>\n<p><strong>Senior Frontend Developer (T10),</strong> Tencent – WeChat Mini Program\tGuangzhou,  Feb 2019 – Present</p>\n<ul>\n<li>\n<p><strong>Transaction order page extraction of transaction products:</strong> Developed a function to extract basic information based on runtime analysis of mini program pages, encapsulated by langchain, interfacing with different internal LLMs, with hallucination check filtering capabilities, verifying information and performing secondary extraction for complex situations, and then caching result paths to optimize request costs for specific product information retrieval.</p>\n</li>\n<li>\n<p><strong>Smart advertising for mini programs:</strong> Zero-code integration to dynamically adjust ad insertion positions and adapt to the original mini program style of WeChat ad components.</p>\n</li>\n<li>\n<p>Developed an intelligent style adaptation capability for ads by analyzing mini program screenshots using self-built algorithms based on OpenCV, recognizing ROI and extracting styles. In simple cases, used edge histograms to analyze strong and weak edges; in complex cases, used distance fields for edge distance transformation, splitting into multiple partitions, and processing with custom directional operators to obtain distinctly featured edges.</p>\n</li>\n<li>\n<p>Developed an intelligent ad position recommendation capability based on multiple recommended positions obtained from runtime logic analysis of mini programs, cleaning and extracting reasonable information, and using a multi-role scoring strategy (structure, experience, experience, conversion) with large models to obtain recommended positions.</p>\n</li>\n<li>\n<p><strong>AR capabilities for mini programs and xr-frame:</strong> An XR/3D framework implemented using Typescript combined with client logic (C++) and AR algorithms based on WXML.</p>\n</li>\n<li>\n<p>Developed the rendering part in xr-frame, implementing PBR (BRDF), fully supporting the glTF 2.0 specification and most extensions, and implementing rendering logic corresponding to different device platforms with OpenGL (mobile), Metal (visionPro), and WebGPU (MetaQuest).</p>\n</li>\n<li>\n<p>Developed and maintained AR capabilities for mini programs (3dof, 6dof, Marker, various bodies) and developed mini program AR cases and xr-frame case collections, interfacing with various service providers and user needs.</p>\n</li>\n<li>\n<p><strong>WeChat Mini Game Engine:</strong> The official engine based on Typescript, using shared memory combined with client logic (C++).</p>\n</li>\n<li>\n<p>Main developer of the 2D system of the engine, achieving independent general rendering capabilities (images/text/graphics), layout capabilities (nodes/text and graphics), interaction capabilities (touch/text input), compatible with most third-party engines' 2D capabilities (NGUI,UGUI,FairyGUI) and providing tool plugins for importing assets from third-party engines.</p>\n</li>\n<li>\n<p>Utilized shared memory node pool recycling to reduce CPU time and GC jank, achieved logical pruning caching and rendering buffering through splitting node subtrees for dynamic and static separation, refining rendering dirty bits and merging dirty queues, and dynamically batching rendering CommandBuffer, achieving performance standards. compared to CocosCreator's 2000 sprite moving cutouts, 4 times faster.</p>\n</li>\n<li>\n<p>Fully supported the integration and specific 2D asset migration of multiple large Unity games (e.g., Tianlong Babu Honor Edition, New Xuanyuan Legend, Legend of the Duel), casual games (e.g., Temple Run, EA Hungry Shark), successfully launched and operated, and was awarded Excellent Employee that year.</p>\n</li>\n</ul>\n<p><strong>Senior Frontend Developer (P6),</strong> Alibaba - Taobao\tHangzhou,  Oct 2017 – Feb 2019</p>\n<ul>\n<li>Developed Taobao's \"Good Goods\" feature page and Double Eleven event page based on Rax (React Weex DSL), and optimized animations and GCanvas transformation (dynamic batching) for Weex (similar to React Native).</li>\n<li><strong>imgcook code intelligent generation platform:</strong> Developed the ability to convert images to code based on OpenCV and OCR through self-built algorithms, as well as a Sketch plugin to convert design drafts to code using structured information from Sketch.</li>\n</ul>\n<p><strong>UI Engineer,</strong> Tencent – ISUX Mobile QQ\tShenzhen,  June 2016 – Oct 2017</p>\n<ul>\n<li>Developed member-related feature pages and webGL (Pixi.js) event pages, collaborated with the design team to establish design specifications, built a business component library FrozenUI, promoted the implementation of APNG into the business, and participated in the development of the APNG production tool iSparta, contributing to the APNG compression algorithm.</li>\n</ul>\n<p>Skills<br>\n<strong>Languages:</strong> Typescript (daily use), Python (daily use), Rust (for wasm), Dart(for india), Dart(for Flutter), C#(for Unity)<br>\n<strong>Technologies:</strong> Unity (game integration, plugin development, independent games), webGL/WebGPU/OpenGL/Metal (implementing PBR), Gaussian Splating (implementing WebGL2 rendering), computer vision/OpenCV (work use), React (independent development), Web Development (principles), StableDiffusion (generating images to SVG), Flutter (parsing SVG and coloring software)<br>\n<strong>Design:</strong> Blender (independently completed rough modeling, model modification, skeleton binding and skinning), Sketch (developing plugins), Figma</p>\n<p>Education<br>\n<strong>South China Agricultural University</strong> – Bachelor of Software Engineering\t Oct 2016</p>\n"}},"__N_SSG":true}